GopalSaraf/Practicals/PSDL/include/proc/pic18f86k90.inc
// Register: CM2CON
#define CM2CON CM2CON
CM2CON                                   equ 0F2Fh
// bitfield definitions
CM2CON_CCH_POSN                          equ 0000h
CM2CON_CCH_POSITION                      equ 0000h
CM2CON_CCH_SIZE                          equ 0002h
CM2CON_CCH_LENGTH                        equ 0002h
CM2CON_CCH_MASK                          equ 0003h
CM2CON_CREF_POSN                         equ 0002h
CM2CON_CREF_POSITION                     equ 0002h
CM2CON_CREF_SIZE                         equ 0001h
CM2CON_CREF_LENGTH                       equ 0001h
CM2CON_CREF_MASK                         equ 0004h
CM2CON_EVPOL_POSN                        equ 0003h
CM2CON_EVPOL_POSITION                    equ 0003h
CM2CON_EVPOL_SIZE                        equ 0002h
CM2CON_EVPOL_LENGTH                      equ 0002h
CM2CON_EVPOL_MASK                        equ 0018h
CM2CON_CPOL_POSN                         equ 0005h
CM2CON_CPOL_POSITION                     equ 0005h
CM2CON_CPOL_SIZE                         equ 0001h
CM2CON_CPOL_LENGTH                       equ 0001h
CM2CON_CPOL_MASK                         equ 0020h
CM2CON_COE_POSN                          equ 0006h
CM2CON_COE_POSITION                      equ 0006h
CM2CON_COE_SIZE                          equ 0001h
CM2CON_COE_LENGTH                        equ 0001h
CM2CON_COE_MASK                          equ 0040h
CM2CON_CON_POSN                          equ 0007h
CM2CON_CON_POSITION                      equ 0007h
CM2CON_CON_SIZE                          equ 0001h
CM2CON_CON_LENGTH                        equ 0001h
CM2CON_CON_MASK                          equ 0080h
CM2CON_CCH0_POSN                         equ 0000h
CM2CON_CCH0_POSITION                     equ 0000h
CM2CON_CCH0_SIZE                         equ 0001h
CM2CON_CCH0_LENGTH                       equ 0001h
CM2CON_CCH0_MASK                         equ 0001h
CM2CON_CCH1_POSN                         equ 0001h
CM2CON_CCH1_POSITION                     equ 0001h
CM2CON_CCH1_SIZE                         equ 0001h
CM2CON_CCH1_LENGTH                       equ 0001h
CM2CON_CCH1_MASK                         equ 0002h
CM2CON_EVPOL0_POSN                       equ 0003h
CM2CON_EVPOL0_POSITION                   equ 0003h
CM2CON_EVPOL0_SIZE                       equ 0001h
CM2CON_EVPOL0_LENGTH                     equ 0001h
CM2CON_EVPOL0_MASK                       equ 0008h
CM2CON_EVPOL1_POSN                       equ 0004h
CM2CON_EVPOL1_POSITION                   equ 0004h
CM2CON_EVPOL1_SIZE                       equ 0001h
CM2CON_EVPOL1_LENGTH                     equ 0001h
CM2CON_EVPOL1_MASK                       equ 0010h
CM2CON_CCH02_POSN                        equ 0000h
CM2CON_CCH02_POSITION                    equ 0000h
CM2CON_CCH02_SIZE                        equ 0001h
CM2CON_CCH02_LENGTH                      equ 0001h
CM2CON_CCH02_MASK                        equ 0001h
CM2CON_CCH12_POSN                        equ 0001h
CM2CON_CCH12_POSITION                    equ 0001h
CM2CON_CCH12_SIZE                        equ 0001h
CM2CON_CCH12_LENGTH                      equ 0001h
CM2CON_CCH12_MASK                        equ 0002h
CM2CON_CREF2_POSN                        equ 0002h
CM2CON_CREF2_POSITION                    equ 0002h
CM2CON_CREF2_SIZE                        equ 0001h
CM2CON_CREF2_LENGTH                      equ 0001h
CM2CON_CREF2_MASK                        equ 0004h
CM2CON_EVPOL02_POSN                      equ 0003h
CM2CON_EVPOL02_POSITION                  equ 0003h
CM2CON_EVPOL02_SIZE                      equ 0001h
CM2CON_EVPOL02_LENGTH                    equ 0001h
CM2CON_EVPOL02_MASK                      equ 0008h
CM2CON_EVPOL12_POSN                      equ 0004h
CM2CON_EVPOL12_POSITION                  equ 0004h
CM2CON_EVPOL12_SIZE                      equ 0001h
CM2CON_EVPOL12_LENGTH                    equ 0001h
CM2CON_EVPOL12_MASK                      equ 0010h
CM2CON_CPOL2_POSN                        equ 0005h
CM2CON_CPOL2_POSITION                    equ 0005h
CM2CON_CPOL2_SIZE                        equ 0001h
CM2CON_CPOL2_LENGTH                      equ 0001h
CM2CON_CPOL2_MASK                        equ 0020h
CM2CON_COE2_POSN                         equ 0006h
CM2CON_COE2_POSITION                     equ 0006h
CM2CON_COE2_SIZE                         equ 0001h
CM2CON_COE2_LENGTH                       equ 0001h
CM2CON_COE2_MASK                         equ 0040h
CM2CON_CON2_POSN                         equ 0007h
CM2CON_CON2_POSITION                     equ 0007h
CM2CON_CON2_SIZE                         equ 0001h
CM2CON_CON2_LENGTH                       equ 0001h
CM2CON_CON2_MASK                         equ 0080h

// Register: T12CON
#define T12CON T12CON
T12CON                                   equ 0F30h
// bitfield definitions
T12CON_T12CKPS_POSN                      equ 0000h
T12CON_T12CKPS_POSITION                  equ 0000h
T12CON_T12CKPS_SIZE                      equ 0002h
T12CON_T12CKPS_LENGTH                    equ 0002h
T12CON_T12CKPS_MASK                      equ 0003h
T12CON_TMR12ON_POSN                      equ 0002h
T12CON_TMR12ON_POSITION                  equ 0002h
T12CON_TMR12ON_SIZE                      equ 0001h
T12CON_TMR12ON_LENGTH                    equ 0001h
T12CON_TMR12ON_MASK                      equ 0004h
T12CON_T12OUTPS_POSN                     equ 0003h
T12CON_T12OUTPS_POSITION                 equ 0003h
T12CON_T12OUTPS_SIZE                     equ 0004h
T12CON_T12OUTPS_LENGTH                   equ 0004h
T12CON_T12OUTPS_MASK                     equ 0078h
T12CON_T12CKPS0_POSN                     equ 0000h
T12CON_T12CKPS0_POSITION                 equ 0000h
T12CON_T12CKPS0_SIZE                     equ 0001h
T12CON_T12CKPS0_LENGTH                   equ 0001h
T12CON_T12CKPS0_MASK                     equ 0001h
T12CON_T12CKPS1_POSN                     equ 0001h
T12CON_T12CKPS1_POSITION                 equ 0001h
T12CON_T12CKPS1_SIZE                     equ 0001h
T12CON_T12CKPS1_LENGTH                   equ 0001h
T12CON_T12CKPS1_MASK                     equ 0002h
T12CON_T12OUTPS0_POSN                    equ 0003h
T12CON_T12OUTPS0_POSITION                equ 0003h
T12CON_T12OUTPS0_SIZE                    equ 0001h
T12CON_T12OUTPS0_LENGTH                  equ 0001h
T12CON_T12OUTPS0_MASK                    equ 0008h
T12CON_T12OUTPS1_POSN                    equ 0004h
T12CON_T12OUTPS1_POSITION                equ 0004h
T12CON_T12OUTPS1_SIZE                    equ 0001h
T12CON_T12OUTPS1_LENGTH                  equ 0001h
T12CON_T12OUTPS1_MASK                    equ 0010h
T12CON_T12OUTPS2_POSN                    equ 0005h
T12CON_T12OUTPS2_POSITION                equ 0005h
T12CON_T12OUTPS2_SIZE                    equ 0001h
T12CON_T12OUTPS2_LENGTH                  equ 0001h
T12CON_T12OUTPS2_MASK                    equ 0020h
T12CON_T12OUTPS3_POSN                    equ 0006h
T12CON_T12OUTPS3_POSITION                equ 0006h
T12CON_T12OUTPS3_SIZE                    equ 0001h
T12CON_T12OUTPS3_LENGTH                  equ 0001h
T12CON_T12OUTPS3_MASK                    equ 0040h

// Register: PR12
#define PR12 PR12
PR12                                     equ 0F31h
// bitfield definitions
PR12_PR12_POSN                           equ 0000h
PR12_PR12_POSITION                       equ 0000h
PR12_PR12_SIZE                           equ 0008h
PR12_PR12_LENGTH                         equ 0008h
PR12_PR12_MASK                           equ 00FFh

