GopalSaraf/Practicals/PSDL/include/proc/pic18f86k90.inc
// Register: LCDDATA13
#define LCDDATA13 LCDDATA13
LCDDATA13                                equ 0F73h
// bitfield definitions
LCDDATA13_S08C2_POSN                     equ 0000h
LCDDATA13_S08C2_POSITION                 equ 0000h
LCDDATA13_S08C2_SIZE                     equ 0001h
LCDDATA13_S08C2_LENGTH                   equ 0001h
LCDDATA13_S08C2_MASK                     equ 0001h
LCDDATA13_S09C2_POSN                     equ 0001h
LCDDATA13_S09C2_POSITION                 equ 0001h
LCDDATA13_S09C2_SIZE                     equ 0001h
LCDDATA13_S09C2_LENGTH                   equ 0001h
LCDDATA13_S09C2_MASK                     equ 0002h
LCDDATA13_S10C2_POSN                     equ 0002h
LCDDATA13_S10C2_POSITION                 equ 0002h
LCDDATA13_S10C2_SIZE                     equ 0001h
LCDDATA13_S10C2_LENGTH                   equ 0001h
LCDDATA13_S10C2_MASK                     equ 0004h
LCDDATA13_S11C2_POSN                     equ 0003h
LCDDATA13_S11C2_POSITION                 equ 0003h
LCDDATA13_S11C2_SIZE                     equ 0001h
LCDDATA13_S11C2_LENGTH                   equ 0001h
LCDDATA13_S11C2_MASK                     equ 0008h
LCDDATA13_S12C2_POSN                     equ 0004h
LCDDATA13_S12C2_POSITION                 equ 0004h
LCDDATA13_S12C2_SIZE                     equ 0001h
LCDDATA13_S12C2_LENGTH                   equ 0001h
LCDDATA13_S12C2_MASK                     equ 0010h
LCDDATA13_S13C2_POSN                     equ 0005h
LCDDATA13_S13C2_POSITION                 equ 0005h
LCDDATA13_S13C2_SIZE                     equ 0001h
LCDDATA13_S13C2_LENGTH                   equ 0001h
LCDDATA13_S13C2_MASK                     equ 0020h
LCDDATA13_S14C2_POSN                     equ 0006h
LCDDATA13_S14C2_POSITION                 equ 0006h
LCDDATA13_S14C2_SIZE                     equ 0001h
LCDDATA13_S14C2_LENGTH                   equ 0001h
LCDDATA13_S14C2_MASK                     equ 0040h
LCDDATA13_S15C2_POSN                     equ 0007h
LCDDATA13_S15C2_POSITION                 equ 0007h
LCDDATA13_S15C2_SIZE                     equ 0001h
LCDDATA13_S15C2_LENGTH                   equ 0001h
LCDDATA13_S15C2_MASK                     equ 0080h

// Register: LCDDATA14
#define LCDDATA14 LCDDATA14
LCDDATA14                                equ 0F74h
// bitfield definitions
LCDDATA14_S16C2_POSN                     equ 0000h
LCDDATA14_S16C2_POSITION                 equ 0000h
LCDDATA14_S16C2_SIZE                     equ 0001h
LCDDATA14_S16C2_LENGTH                   equ 0001h
LCDDATA14_S16C2_MASK                     equ 0001h
LCDDATA14_S17C2_POSN                     equ 0001h
LCDDATA14_S17C2_POSITION                 equ 0001h
LCDDATA14_S17C2_SIZE                     equ 0001h
LCDDATA14_S17C2_LENGTH                   equ 0001h
LCDDATA14_S17C2_MASK                     equ 0002h
LCDDATA14_S18C2_POSN                     equ 0002h
LCDDATA14_S18C2_POSITION                 equ 0002h
LCDDATA14_S18C2_SIZE                     equ 0001h
LCDDATA14_S18C2_LENGTH                   equ 0001h
LCDDATA14_S18C2_MASK                     equ 0004h
LCDDATA14_S19C2_POSN                     equ 0003h
LCDDATA14_S19C2_POSITION                 equ 0003h
LCDDATA14_S19C2_SIZE                     equ 0001h
LCDDATA14_S19C2_LENGTH                   equ 0001h
LCDDATA14_S19C2_MASK                     equ 0008h
LCDDATA14_S20C2_POSN                     equ 0004h
LCDDATA14_S20C2_POSITION                 equ 0004h
LCDDATA14_S20C2_SIZE                     equ 0001h
LCDDATA14_S20C2_LENGTH                   equ 0001h
LCDDATA14_S20C2_MASK                     equ 0010h
LCDDATA14_S21C2_POSN                     equ 0005h
LCDDATA14_S21C2_POSITION                 equ 0005h
LCDDATA14_S21C2_SIZE                     equ 0001h
LCDDATA14_S21C2_LENGTH                   equ 0001h
LCDDATA14_S21C2_MASK                     equ 0020h
LCDDATA14_S22C2_POSN                     equ 0006h
LCDDATA14_S22C2_POSITION                 equ 0006h
LCDDATA14_S22C2_SIZE                     equ 0001h
LCDDATA14_S22C2_LENGTH                   equ 0001h
LCDDATA14_S22C2_MASK                     equ 0040h
LCDDATA14_S23C2_POSN                     equ 0007h
LCDDATA14_S23C2_POSITION                 equ 0007h
LCDDATA14_S23C2_SIZE                     equ 0001h
LCDDATA14_S23C2_LENGTH                   equ 0001h
LCDDATA14_S23C2_MASK                     equ 0080h
LCDDATA14_MSK0_POSN                      equ 0000h
LCDDATA14_MSK0_POSITION                  equ 0000h
LCDDATA14_MSK0_SIZE                      equ 0001h
LCDDATA14_MSK0_LENGTH                    equ 0001h
LCDDATA14_MSK0_MASK                      equ 0001h
LCDDATA14_MSK1_POSN                      equ 0001h
LCDDATA14_MSK1_POSITION                  equ 0001h
LCDDATA14_MSK1_SIZE                      equ 0001h
LCDDATA14_MSK1_LENGTH                    equ 0001h
LCDDATA14_MSK1_MASK                      equ 0002h
LCDDATA14_MSK2_POSN                      equ 0002h
LCDDATA14_MSK2_POSITION                  equ 0002h
LCDDATA14_MSK2_SIZE                      equ 0001h
LCDDATA14_MSK2_LENGTH                    equ 0001h
LCDDATA14_MSK2_MASK                      equ 0004h
LCDDATA14_MSK3_POSN                      equ 0003h
LCDDATA14_MSK3_POSITION                  equ 0003h
LCDDATA14_MSK3_SIZE                      equ 0001h
LCDDATA14_MSK3_LENGTH                    equ 0001h
LCDDATA14_MSK3_MASK                      equ 0008h
LCDDATA14_MSK4_POSN                      equ 0004h
LCDDATA14_MSK4_POSITION                  equ 0004h
LCDDATA14_MSK4_SIZE                      equ 0001h
LCDDATA14_MSK4_LENGTH                    equ 0001h
LCDDATA14_MSK4_MASK                      equ 0010h
LCDDATA14_MSK5_POSN                      equ 0005h
LCDDATA14_MSK5_POSITION                  equ 0005h
LCDDATA14_MSK5_SIZE                      equ 0001h
LCDDATA14_MSK5_LENGTH                    equ 0001h
LCDDATA14_MSK5_MASK                      equ 0020h
LCDDATA14_MSK6_POSN                      equ 0006h
LCDDATA14_MSK6_POSITION                  equ 0006h
LCDDATA14_MSK6_SIZE                      equ 0001h
LCDDATA14_MSK6_LENGTH                    equ 0001h
LCDDATA14_MSK6_MASK                      equ 0040h
LCDDATA14_MSK7_POSN                      equ 0007h
LCDDATA14_MSK7_POSITION                  equ 0007h
LCDDATA14_MSK7_SIZE                      equ 0001h
LCDDATA14_MSK7_LENGTH                    equ 0001h
LCDDATA14_MSK7_MASK                      equ 0080h

