GopalSaraf/Practicals/PSDL/include/proc/pic18f86k90.inc
// Register: PORTE
#define PORTE PORTE
PORTE                                    equ 0F84h
// bitfield definitions
PORTE_RE0_POSN                           equ 0000h
PORTE_RE0_POSITION                       equ 0000h
PORTE_RE0_SIZE                           equ 0001h
PORTE_RE0_LENGTH                         equ 0001h
PORTE_RE0_MASK                           equ 0001h
PORTE_RE1_POSN                           equ 0001h
PORTE_RE1_POSITION                       equ 0001h
PORTE_RE1_SIZE                           equ 0001h
PORTE_RE1_LENGTH                         equ 0001h
PORTE_RE1_MASK                           equ 0002h
PORTE_RE2_POSN                           equ 0002h
PORTE_RE2_POSITION                       equ 0002h
PORTE_RE2_SIZE                           equ 0001h
PORTE_RE2_LENGTH                         equ 0001h
PORTE_RE2_MASK                           equ 0004h
PORTE_RE3_POSN                           equ 0003h
PORTE_RE3_POSITION                       equ 0003h
PORTE_RE3_SIZE                           equ 0001h
PORTE_RE3_LENGTH                         equ 0001h
PORTE_RE3_MASK                           equ 0008h
PORTE_RE4_POSN                           equ 0004h
PORTE_RE4_POSITION                       equ 0004h
PORTE_RE4_SIZE                           equ 0001h
PORTE_RE4_LENGTH                         equ 0001h
PORTE_RE4_MASK                           equ 0010h
PORTE_RE5_POSN                           equ 0005h
PORTE_RE5_POSITION                       equ 0005h
PORTE_RE5_SIZE                           equ 0001h
PORTE_RE5_LENGTH                         equ 0001h
PORTE_RE5_MASK                           equ 0020h
PORTE_RE6_POSN                           equ 0006h
PORTE_RE6_POSITION                       equ 0006h
PORTE_RE6_SIZE                           equ 0001h
PORTE_RE6_LENGTH                         equ 0001h
PORTE_RE6_MASK                           equ 0040h
PORTE_RE7_POSN                           equ 0007h
PORTE_RE7_POSITION                       equ 0007h
PORTE_RE7_SIZE                           equ 0001h
PORTE_RE7_LENGTH                         equ 0001h
PORTE_RE7_MASK                           equ 0080h
PORTE_AD8_POSN                           equ 0000h
PORTE_AD8_POSITION                       equ 0000h
PORTE_AD8_SIZE                           equ 0001h
PORTE_AD8_LENGTH                         equ 0001h
PORTE_AD8_MASK                           equ 0001h
PORTE_AD9_POSN                           equ 0001h
PORTE_AD9_POSITION                       equ 0001h
PORTE_AD9_SIZE                           equ 0001h
PORTE_AD9_LENGTH                         equ 0001h
PORTE_AD9_MASK                           equ 0002h
PORTE_AD10_POSN                          equ 0002h
PORTE_AD10_POSITION                      equ 0002h
PORTE_AD10_SIZE                          equ 0001h
PORTE_AD10_LENGTH                        equ 0001h
PORTE_AD10_MASK                          equ 0004h
PORTE_AD11_POSN                          equ 0003h
PORTE_AD11_POSITION                      equ 0003h
PORTE_AD11_SIZE                          equ 0001h
PORTE_AD11_LENGTH                        equ 0001h
PORTE_AD11_MASK                          equ 0008h
PORTE_AD12_POSN                          equ 0004h
PORTE_AD12_POSITION                      equ 0004h
PORTE_AD12_SIZE                          equ 0001h
PORTE_AD12_LENGTH                        equ 0001h
PORTE_AD12_MASK                          equ 0010h
PORTE_AD13_POSN                          equ 0005h
PORTE_AD13_POSITION                      equ 0005h
PORTE_AD13_SIZE                          equ 0001h
PORTE_AD13_LENGTH                        equ 0001h
PORTE_AD13_MASK                          equ 0020h
PORTE_AD14_POSN                          equ 0006h
PORTE_AD14_POSITION                      equ 0006h
PORTE_AD14_SIZE                          equ 0001h
PORTE_AD14_LENGTH                        equ 0001h
PORTE_AD14_MASK                          equ 0040h
PORTE_AD15_POSN                          equ 0007h
PORTE_AD15_POSITION                      equ 0007h
PORTE_AD15_SIZE                          equ 0001h
PORTE_AD15_LENGTH                        equ 0001h
PORTE_AD15_MASK                          equ 0080h
PORTE_PD2_POSN                           equ 0000h
PORTE_PD2_POSITION                       equ 0000h
PORTE_PD2_SIZE                           equ 0001h
PORTE_PD2_LENGTH                         equ 0001h
PORTE_PD2_MASK                           equ 0001h
PORTE_PC2_POSN                           equ 0001h
PORTE_PC2_POSITION                       equ 0001h
PORTE_PC2_SIZE                           equ 0001h
PORTE_PC2_LENGTH                         equ 0001h
PORTE_PC2_MASK                           equ 0002h
PORTE_PB2_POSN                           equ 0002h
PORTE_PB2_POSITION                       equ 0002h
PORTE_PB2_SIZE                           equ 0001h
PORTE_PB2_LENGTH                         equ 0001h
PORTE_PB2_MASK                           equ 0004h
PORTE_PC3_POSN                           equ 0003h
PORTE_PC3_POSITION                       equ 0003h
PORTE_PC3_SIZE                           equ 0001h
PORTE_PC3_LENGTH                         equ 0001h
PORTE_PC3_MASK                           equ 0008h
PORTE_PB3_POSN                           equ 0004h
PORTE_PB3_POSITION                       equ 0004h
PORTE_PB3_SIZE                           equ 0001h
PORTE_PB3_LENGTH                         equ 0001h
PORTE_PB3_MASK                           equ 0010h
PORTE_PC1_POSN                           equ 0005h
PORTE_PC1_POSITION                       equ 0005h
PORTE_PC1_SIZE                           equ 0001h
PORTE_PC1_LENGTH                         equ 0001h
PORTE_PC1_MASK                           equ 0020h
PORTE_PB1_POSN                           equ 0006h
PORTE_PB1_POSITION                       equ 0006h
PORTE_PB1_SIZE                           equ 0001h
PORTE_PB1_LENGTH                         equ 0001h
PORTE_PB1_MASK                           equ 0040h
PORTE_PA2_POSN                           equ 0007h
PORTE_PA2_POSITION                       equ 0007h
PORTE_PA2_SIZE                           equ 0001h
PORTE_PA2_LENGTH                         equ 0001h
PORTE_PA2_MASK                           equ 0080h
PORTE_CCP10_POSN                         equ 0002h
PORTE_CCP10_POSITION                     equ 0002h
PORTE_CCP10_SIZE                         equ 0001h
PORTE_CCP10_LENGTH                       equ 0001h
PORTE_CCP10_MASK                         equ 0004h
PORTE_CCP9_POSN                          equ 0003h
PORTE_CCP9_POSITION                      equ 0003h
PORTE_CCP9_SIZE                          equ 0001h
PORTE_CCP9_LENGTH                        equ 0001h
PORTE_CCP9_MASK                          equ 0008h
PORTE_CCP8_POSN                          equ 0004h
PORTE_CCP8_POSITION                      equ 0004h
PORTE_CCP8_SIZE                          equ 0001h
PORTE_CCP8_LENGTH                        equ 0001h
PORTE_CCP8_MASK                          equ 0010h
PORTE_CCP7_POSN                          equ 0005h
PORTE_CCP7_POSITION                      equ 0005h
PORTE_CCP7_SIZE                          equ 0001h
PORTE_CCP7_LENGTH                        equ 0001h
PORTE_CCP7_MASK                          equ 0020h
PORTE_CCP6_POSN                          equ 0006h
PORTE_CCP6_POSITION                      equ 0006h
PORTE_CCP6_SIZE                          equ 0001h
PORTE_CCP6_LENGTH                        equ 0001h
PORTE_CCP6_MASK                          equ 0040h
PORTE_CCP2_POSN                          equ 0007h
PORTE_CCP2_POSITION                      equ 0007h
PORTE_CCP2_SIZE                          equ 0001h
PORTE_CCP2_LENGTH                        equ 0001h
PORTE_CCP2_MASK                          equ 0080h
PORTE_RD_POSN                            equ 0000h
PORTE_RD_POSITION                        equ 0000h
PORTE_RD_SIZE                            equ 0001h
PORTE_RD_LENGTH                          equ 0001h
PORTE_RD_MASK                            equ 0001h
PORTE_WR_POSN                            equ 0001h
PORTE_WR_POSITION                        equ 0001h
PORTE_WR_SIZE                            equ 0001h
PORTE_WR_LENGTH                          equ 0001h
PORTE_WR_MASK                            equ 0002h
PORTE_CS_POSN                            equ 0002h
PORTE_CS_POSITION                        equ 0002h
PORTE_CS_SIZE                            equ 0001h
PORTE_CS_LENGTH                          equ 0001h
PORTE_CS_MASK                            equ 0004h
PORTE_COM0_POSN                          equ 0003h
PORTE_COM0_POSITION                      equ 0003h
PORTE_COM0_SIZE                          equ 0001h
PORTE_COM0_LENGTH                        equ 0001h
PORTE_COM0_MASK                          equ 0008h
PORTE_COM1_POSN                          equ 0004h
PORTE_COM1_POSITION                      equ 0004h
PORTE_COM1_SIZE                          equ 0001h
PORTE_COM1_LENGTH                        equ 0001h
PORTE_COM1_MASK                          equ 0010h
PORTE_COM2_POSN                          equ 0005h
PORTE_COM2_POSITION                      equ 0005h
PORTE_COM2_SIZE                          equ 0001h
PORTE_COM2_LENGTH                        equ 0001h
PORTE_COM2_MASK                          equ 0020h
PORTE_COM3_POSN                          equ 0006h
PORTE_COM3_POSITION                      equ 0006h
PORTE_COM3_SIZE                          equ 0001h
PORTE_COM3_LENGTH                        equ 0001h
PORTE_COM3_MASK                          equ 0040h
PORTE_SEG31_POSN                         equ 0007h
PORTE_SEG31_POSITION                     equ 0007h
PORTE_SEG31_SIZE                         equ 0001h
PORTE_SEG31_LENGTH                       equ 0001h
PORTE_SEG31_MASK                         equ 0080h
PORTE_LCDBIAS1_POSN                      equ 0000h
PORTE_LCDBIAS1_POSITION                  equ 0000h
PORTE_LCDBIAS1_SIZE                      equ 0001h
PORTE_LCDBIAS1_LENGTH                    equ 0001h
PORTE_LCDBIAS1_MASK                      equ 0001h
PORTE_LCDBIAS2_POSN                      equ 0001h
PORTE_LCDBIAS2_POSITION                  equ 0001h
PORTE_LCDBIAS2_SIZE                      equ 0001h
PORTE_LCDBIAS2_LENGTH                    equ 0001h
PORTE_LCDBIAS2_MASK                      equ 0002h
PORTE_LCDBIAS3_POSN                      equ 0002h
PORTE_LCDBIAS3_POSITION                  equ 0002h
PORTE_LCDBIAS3_SIZE                      equ 0001h
PORTE_LCDBIAS3_LENGTH                    equ 0001h
PORTE_LCDBIAS3_MASK                      equ 0004h
PORTE_REFO_POSN                          equ 0004h
PORTE_REFO_POSITION                      equ 0004h
PORTE_REFO_SIZE                          equ 0001h
PORTE_REFO_LENGTH                        equ 0001h
PORTE_REFO_MASK                          equ 0010h
PORTE_RDE_POSN                           equ 0000h
PORTE_RDE_POSITION                       equ 0000h
PORTE_RDE_SIZE                           equ 0001h
PORTE_RDE_LENGTH                         equ 0001h
PORTE_RDE_MASK                           equ 0001h
PORTE_WRE_POSN                           equ 0001h
PORTE_WRE_POSITION                       equ 0001h
PORTE_WRE_SIZE                           equ 0001h
PORTE_WRE_LENGTH                         equ 0001h
PORTE_WRE_MASK                           equ 0002h
PORTE_CCP9E_POSN                         equ 0003h
PORTE_CCP9E_POSITION                     equ 0003h
PORTE_CCP9E_SIZE                         equ 0001h
PORTE_CCP9E_LENGTH                       equ 0001h
PORTE_CCP9E_MASK                         equ 0008h
PORTE_CCP8E_POSN                         equ 0004h
PORTE_CCP8E_POSITION                     equ 0004h
PORTE_CCP8E_SIZE                         equ 0001h
PORTE_CCP8E_LENGTH                       equ 0001h
PORTE_CCP8E_MASK                         equ 0010h
PORTE_CCP7E_POSN                         equ 0005h
PORTE_CCP7E_POSITION                     equ 0005h
PORTE_CCP7E_SIZE                         equ 0001h
PORTE_CCP7E_LENGTH                       equ 0001h
PORTE_CCP7E_MASK                         equ 0020h
PORTE_CCP6E_POSN                         equ 0006h
PORTE_CCP6E_POSITION                     equ 0006h
PORTE_CCP6E_SIZE                         equ 0001h
PORTE_CCP6E_LENGTH                       equ 0001h
PORTE_CCP6E_MASK                         equ 0040h
PORTE_CCP2E_POSN                         equ 0007h
PORTE_CCP2E_POSITION                     equ 0007h
PORTE_CCP2E_SIZE                         equ 0001h
PORTE_CCP2E_LENGTH                       equ 0001h
PORTE_CCP2E_MASK                         equ 0080h
PORTE_PC3E_POSN                          equ 0003h
PORTE_PC3E_POSITION                      equ 0003h
PORTE_PC3E_SIZE                          equ 0001h
PORTE_PC3E_LENGTH                        equ 0001h
PORTE_PC3E_MASK                          equ 0008h
PORTE_PB3E_POSN                          equ 0004h
PORTE_PB3E_POSITION                      equ 0004h
PORTE_PB3E_SIZE                          equ 0001h
PORTE_PB3E_LENGTH                        equ 0001h
PORTE_PB3E_MASK                          equ 0010h
PORTE_PC1E_POSN                          equ 0005h
PORTE_PC1E_POSITION                      equ 0005h
PORTE_PC1E_SIZE                          equ 0001h
PORTE_PC1E_LENGTH                        equ 0001h
PORTE_PC1E_MASK                          equ 0020h
PORTE_PB1E_POSN                          equ 0006h
PORTE_PB1E_POSITION                      equ 0006h
PORTE_PB1E_SIZE                          equ 0001h
PORTE_PB1E_LENGTH                        equ 0001h
PORTE_PB1E_MASK                          equ 0040h
PORTE_PA2E_POSN                          equ 0007h
PORTE_PA2E_POSITION                      equ 0007h
PORTE_PA2E_SIZE                          equ 0001h
PORTE_PA2E_LENGTH                        equ 0001h
PORTE_PA2E_MASK                          equ 0080h

