GopalSaraf/Practicals/PSDL/include/proc/pic18f86k90.inc
// Register: PORTH
#define PORTH PORTH
PORTH                                    equ 0F87h
// bitfield definitions
PORTH_RH0_POSN                           equ 0000h
PORTH_RH0_POSITION                       equ 0000h
PORTH_RH0_SIZE                           equ 0001h
PORTH_RH0_LENGTH                         equ 0001h
PORTH_RH0_MASK                           equ 0001h
PORTH_RH1_POSN                           equ 0001h
PORTH_RH1_POSITION                       equ 0001h
PORTH_RH1_SIZE                           equ 0001h
PORTH_RH1_LENGTH                         equ 0001h
PORTH_RH1_MASK                           equ 0002h
PORTH_RH2_POSN                           equ 0002h
PORTH_RH2_POSITION                       equ 0002h
PORTH_RH2_SIZE                           equ 0001h
PORTH_RH2_LENGTH                         equ 0001h
PORTH_RH2_MASK                           equ 0004h
PORTH_RH3_POSN                           equ 0003h
PORTH_RH3_POSITION                       equ 0003h
PORTH_RH3_SIZE                           equ 0001h
PORTH_RH3_LENGTH                         equ 0001h
PORTH_RH3_MASK                           equ 0008h
PORTH_RH4_POSN                           equ 0004h
PORTH_RH4_POSITION                       equ 0004h
PORTH_RH4_SIZE                           equ 0001h
PORTH_RH4_LENGTH                         equ 0001h
PORTH_RH4_MASK                           equ 0010h
PORTH_RH5_POSN                           equ 0005h
PORTH_RH5_POSITION                       equ 0005h
PORTH_RH5_SIZE                           equ 0001h
PORTH_RH5_LENGTH                         equ 0001h
PORTH_RH5_MASK                           equ 0020h
PORTH_RH6_POSN                           equ 0006h
PORTH_RH6_POSITION                       equ 0006h
PORTH_RH6_SIZE                           equ 0001h
PORTH_RH6_LENGTH                         equ 0001h
PORTH_RH6_MASK                           equ 0040h
PORTH_RH7_POSN                           equ 0007h
PORTH_RH7_POSITION                       equ 0007h
PORTH_RH7_SIZE                           equ 0001h
PORTH_RH7_LENGTH                         equ 0001h
PORTH_RH7_MASK                           equ 0080h
PORTH_SEG47_POSN                         equ 0000h
PORTH_SEG47_POSITION                     equ 0000h
PORTH_SEG47_SIZE                         equ 0001h
PORTH_SEG47_LENGTH                       equ 0001h
PORTH_SEG47_MASK                         equ 0001h
PORTH_SEG46_POSN                         equ 0001h
PORTH_SEG46_POSITION                     equ 0001h
PORTH_SEG46_SIZE                         equ 0001h
PORTH_SEG46_LENGTH                       equ 0001h
PORTH_SEG46_MASK                         equ 0002h
PORTH_SEG45_POSN                         equ 0002h
PORTH_SEG45_POSITION                     equ 0002h
PORTH_SEG45_SIZE                         equ 0001h
PORTH_SEG45_LENGTH                       equ 0001h
PORTH_SEG45_MASK                         equ 0004h
PORTH_SEG44_POSN                         equ 0003h
PORTH_SEG44_POSITION                     equ 0003h
PORTH_SEG44_SIZE                         equ 0001h
PORTH_SEG44_LENGTH                       equ 0001h
PORTH_SEG44_MASK                         equ 0008h
PORTH_SEG40_POSN                         equ 0004h
PORTH_SEG40_POSITION                     equ 0004h
PORTH_SEG40_SIZE                         equ 0001h
PORTH_SEG40_LENGTH                       equ 0001h
PORTH_SEG40_MASK                         equ 0010h
PORTH_SEG41_POSN                         equ 0005h
PORTH_SEG41_POSITION                     equ 0005h
PORTH_SEG41_SIZE                         equ 0001h
PORTH_SEG41_LENGTH                       equ 0001h
PORTH_SEG41_MASK                         equ 0020h
PORTH_SEG42_POSN                         equ 0006h
PORTH_SEG42_POSITION                     equ 0006h
PORTH_SEG42_SIZE                         equ 0001h
PORTH_SEG42_LENGTH                       equ 0001h
PORTH_SEG42_MASK                         equ 0040h
PORTH_SEG43_POSN                         equ 0007h
PORTH_SEG43_POSITION                     equ 0007h
PORTH_SEG43_SIZE                         equ 0001h
PORTH_SEG43_LENGTH                       equ 0001h
PORTH_SEG43_MASK                         equ 0080h
PORTH_AN23_POSN                          equ 0000h
PORTH_AN23_POSITION                      equ 0000h
PORTH_AN23_SIZE                          equ 0001h
PORTH_AN23_LENGTH                        equ 0001h
PORTH_AN23_MASK                          equ 0001h
PORTH_AN22_POSN                          equ 0001h
PORTH_AN22_POSITION                      equ 0001h
PORTH_AN22_SIZE                          equ 0001h
PORTH_AN22_LENGTH                        equ 0001h
PORTH_AN22_MASK                          equ 0002h
PORTH_AN21_POSN                          equ 0002h
PORTH_AN21_POSITION                      equ 0002h
PORTH_AN21_SIZE                          equ 0001h
PORTH_AN21_LENGTH                        equ 0001h
PORTH_AN21_MASK                          equ 0004h
PORTH_AN20_POSN                          equ 0003h
PORTH_AN20_POSITION                      equ 0003h
PORTH_AN20_SIZE                          equ 0001h
PORTH_AN20_LENGTH                        equ 0001h
PORTH_AN20_MASK                          equ 0008h
PORTH_AN12_POSN                          equ 0004h
PORTH_AN12_POSITION                      equ 0004h
PORTH_AN12_SIZE                          equ 0001h
PORTH_AN12_LENGTH                        equ 0001h
PORTH_AN12_MASK                          equ 0010h
PORTH_AN13_POSN                          equ 0005h
PORTH_AN13_POSITION                      equ 0005h
PORTH_AN13_SIZE                          equ 0001h
PORTH_AN13_LENGTH                        equ 0001h
PORTH_AN13_MASK                          equ 0020h
PORTH_AN14_POSN                          equ 0006h
PORTH_AN14_POSITION                      equ 0006h
PORTH_AN14_SIZE                          equ 0001h
PORTH_AN14_LENGTH                        equ 0001h
PORTH_AN14_MASK                          equ 0040h
PORTH_AN15_POSN                          equ 0007h
PORTH_AN15_POSITION                      equ 0007h
PORTH_AN15_SIZE                          equ 0001h
PORTH_AN15_LENGTH                        equ 0001h
PORTH_AN15_MASK                          equ 0080h
PORTH_A16_POSN                           equ 0000h
PORTH_A16_POSITION                       equ 0000h
PORTH_A16_SIZE                           equ 0001h
PORTH_A16_LENGTH                         equ 0001h
PORTH_A16_MASK                           equ 0001h
PORTH_A17_POSN                           equ 0001h
PORTH_A17_POSITION                       equ 0001h
PORTH_A17_SIZE                           equ 0001h
PORTH_A17_LENGTH                         equ 0001h
PORTH_A17_MASK                           equ 0002h
PORTH_A18_POSN                           equ 0002h
PORTH_A18_POSITION                       equ 0002h
PORTH_A18_SIZE                           equ 0001h
PORTH_A18_LENGTH                         equ 0001h
PORTH_A18_MASK                           equ 0004h
PORTH_A19_POSN                           equ 0003h
PORTH_A19_POSITION                       equ 0003h
PORTH_A19_SIZE                           equ 0001h
PORTH_A19_LENGTH                         equ 0001h
PORTH_A19_MASK                           equ 0008h
PORTH_CCP9_POSN                          equ 0004h
PORTH_CCP9_POSITION                      equ 0004h
PORTH_CCP9_SIZE                          equ 0001h
PORTH_CCP9_LENGTH                        equ 0001h
PORTH_CCP9_MASK                          equ 0010h
PORTH_CCP8_POSN                          equ 0005h
PORTH_CCP8_POSITION                      equ 0005h
PORTH_CCP8_SIZE                          equ 0001h
PORTH_CCP8_LENGTH                        equ 0001h
PORTH_CCP8_MASK                          equ 0020h
PORTH_CCP7_POSN                          equ 0006h
PORTH_CCP7_POSITION                      equ 0006h
PORTH_CCP7_SIZE                          equ 0001h
PORTH_CCP7_LENGTH                        equ 0001h
PORTH_CCP7_MASK                          equ 0040h
PORTH_CCP6_POSN                          equ 0007h
PORTH_CCP6_POSITION                      equ 0007h
PORTH_CCP6_SIZE                          equ 0001h
PORTH_CCP6_LENGTH                        equ 0001h
PORTH_CCP6_MASK                          equ 0080h
PORTH_PC3_POSN                           equ 0004h
PORTH_PC3_POSITION                       equ 0004h
PORTH_PC3_SIZE                           equ 0001h
PORTH_PC3_LENGTH                         equ 0001h
PORTH_PC3_MASK                           equ 0010h
PORTH_PB3_POSN                           equ 0005h
PORTH_PB3_POSITION                       equ 0005h
PORTH_PB3_SIZE                           equ 0001h
PORTH_PB3_LENGTH                         equ 0001h
PORTH_PB3_MASK                           equ 0020h
PORTH_PC1_POSN                           equ 0006h
PORTH_PC1_POSITION                       equ 0006h
PORTH_PC1_SIZE                           equ 0001h
PORTH_PC1_LENGTH                         equ 0001h
PORTH_PC1_MASK                           equ 0040h
PORTH_PB1_POSN                           equ 0007h
PORTH_PB1_POSITION                       equ 0007h
PORTH_PB1_SIZE                           equ 0001h
PORTH_PB1_LENGTH                         equ 0001h
PORTH_PB1_MASK                           equ 0080h
PORTH_C2INC_POSN                         equ 0004h
PORTH_C2INC_POSITION                     equ 0004h
PORTH_C2INC_SIZE                         equ 0001h
PORTH_C2INC_LENGTH                       equ 0001h
PORTH_C2INC_MASK                         equ 0010h
PORTH_C2IND_POSN                         equ 0005h
PORTH_C2IND_POSITION                     equ 0005h
PORTH_C2IND_SIZE                         equ 0001h
PORTH_C2IND_LENGTH                       equ 0001h
PORTH_C2IND_MASK                         equ 0020h
PORTH_C1INC_POSN                         equ 0006h
PORTH_C1INC_POSITION                     equ 0006h
PORTH_C1INC_SIZE                         equ 0001h
PORTH_C1INC_LENGTH                       equ 0001h
PORTH_C1INC_MASK                         equ 0040h

// Register: PORTJ
#define PORTJ PORTJ
PORTJ                                    equ 0F88h
// bitfield definitions
PORTJ_RJ0_POSN                           equ 0000h
PORTJ_RJ0_POSITION                       equ 0000h
PORTJ_RJ0_SIZE                           equ 0001h
PORTJ_RJ0_LENGTH                         equ 0001h
PORTJ_RJ0_MASK                           equ 0001h
PORTJ_RJ1_POSN                           equ 0001h
PORTJ_RJ1_POSITION                       equ 0001h
PORTJ_RJ1_SIZE                           equ 0001h
PORTJ_RJ1_LENGTH                         equ 0001h
PORTJ_RJ1_MASK                           equ 0002h
PORTJ_RJ2_POSN                           equ 0002h
PORTJ_RJ2_POSITION                       equ 0002h
PORTJ_RJ2_SIZE                           equ 0001h
PORTJ_RJ2_LENGTH                         equ 0001h
PORTJ_RJ2_MASK                           equ 0004h
PORTJ_RJ3_POSN                           equ 0003h
PORTJ_RJ3_POSITION                       equ 0003h
PORTJ_RJ3_SIZE                           equ 0001h
PORTJ_RJ3_LENGTH                         equ 0001h
PORTJ_RJ3_MASK                           equ 0008h
PORTJ_RJ4_POSN                           equ 0004h
PORTJ_RJ4_POSITION                       equ 0004h
PORTJ_RJ4_SIZE                           equ 0001h
PORTJ_RJ4_LENGTH                         equ 0001h
PORTJ_RJ4_MASK                           equ 0010h
PORTJ_RJ5_POSN                           equ 0005h
PORTJ_RJ5_POSITION                       equ 0005h
PORTJ_RJ5_SIZE                           equ 0001h
PORTJ_RJ5_LENGTH                         equ 0001h
PORTJ_RJ5_MASK                           equ 0020h
PORTJ_RJ6_POSN                           equ 0006h
PORTJ_RJ6_POSITION                       equ 0006h
PORTJ_RJ6_SIZE                           equ 0001h
PORTJ_RJ6_LENGTH                         equ 0001h
PORTJ_RJ6_MASK                           equ 0040h
PORTJ_RJ7_POSN                           equ 0007h
PORTJ_RJ7_POSITION                       equ 0007h
PORTJ_RJ7_SIZE                           equ 0001h
PORTJ_RJ7_LENGTH                         equ 0001h
PORTJ_RJ7_MASK                           equ 0080h
PORTJ_ALE_POSN                           equ 0000h
PORTJ_ALE_POSITION                       equ 0000h
PORTJ_ALE_SIZE                           equ 0001h
PORTJ_ALE_LENGTH                         equ 0001h
PORTJ_ALE_MASK                           equ 0001h
PORTJ_OE_POSN                            equ 0001h
PORTJ_OE_POSITION                        equ 0001h
PORTJ_OE_SIZE                            equ 0001h
PORTJ_OE_LENGTH                          equ 0001h
PORTJ_OE_MASK                            equ 0002h
PORTJ_WRL_POSN                           equ 0002h
PORTJ_WRL_POSITION                       equ 0002h
PORTJ_WRL_SIZE                           equ 0001h
PORTJ_WRL_LENGTH                         equ 0001h
PORTJ_WRL_MASK                           equ 0004h
PORTJ_WRH_POSN                           equ 0003h
PORTJ_WRH_POSITION                       equ 0003h
PORTJ_WRH_SIZE                           equ 0001h
PORTJ_WRH_LENGTH                         equ 0001h
PORTJ_WRH_MASK                           equ 0008h
PORTJ_BA0_POSN                           equ 0004h
PORTJ_BA0_POSITION                       equ 0004h
PORTJ_BA0_SIZE                           equ 0001h
PORTJ_BA0_LENGTH                         equ 0001h
PORTJ_BA0_MASK                           equ 0010h
PORTJ_CE_POSN                            equ 0005h
PORTJ_CE_POSITION                        equ 0005h
PORTJ_CE_SIZE                            equ 0001h
PORTJ_CE_LENGTH                          equ 0001h
PORTJ_CE_MASK                            equ 0020h
PORTJ_LB_POSN                            equ 0006h
PORTJ_LB_POSITION                        equ 0006h
PORTJ_LB_SIZE                            equ 0001h
PORTJ_LB_LENGTH                          equ 0001h
PORTJ_LB_MASK                            equ 0040h
PORTJ_UB_POSN                            equ 0007h
PORTJ_UB_POSITION                        equ 0007h
PORTJ_UB_SIZE                            equ 0001h
PORTJ_UB_LENGTH                          equ 0001h
PORTJ_UB_MASK                            equ 0080h
PORTJ_SEG33_POSN                         equ 0001h
PORTJ_SEG33_POSITION                     equ 0001h
PORTJ_SEG33_SIZE                         equ 0001h
PORTJ_SEG33_LENGTH                       equ 0001h
PORTJ_SEG33_MASK                         equ 0002h
PORTJ_SEG34_POSN                         equ 0002h
PORTJ_SEG34_POSITION                     equ 0002h
PORTJ_SEG34_SIZE                         equ 0001h
PORTJ_SEG34_LENGTH                       equ 0001h
PORTJ_SEG34_MASK                         equ 0004h
PORTJ_SEG35_POSN                         equ 0003h
PORTJ_SEG35_POSITION                     equ 0003h
PORTJ_SEG35_SIZE                         equ 0001h
PORTJ_SEG35_LENGTH                       equ 0001h
PORTJ_SEG35_MASK                         equ 0008h
PORTJ_SEG39_POSN                         equ 0004h
PORTJ_SEG39_POSITION                     equ 0004h
PORTJ_SEG39_SIZE                         equ 0001h
PORTJ_SEG39_LENGTH                       equ 0001h
PORTJ_SEG39_MASK                         equ 0010h
PORTJ_SEG38_POSN                         equ 0005h
PORTJ_SEG38_POSITION                     equ 0005h
PORTJ_SEG38_SIZE                         equ 0001h
PORTJ_SEG38_LENGTH                       equ 0001h
PORTJ_SEG38_MASK                         equ 0020h
PORTJ_SEG37_POSN                         equ 0006h
PORTJ_SEG37_POSITION                     equ 0006h
PORTJ_SEG37_SIZE                         equ 0001h
PORTJ_SEG37_LENGTH                       equ 0001h
PORTJ_SEG37_MASK                         equ 0040h
PORTJ_SEG36_POSN                         equ 0007h
PORTJ_SEG36_POSITION                     equ 0007h
PORTJ_SEG36_SIZE                         equ 0001h
PORTJ_SEG36_LENGTH                       equ 0001h
PORTJ_SEG36_MASK                         equ 0080h

