GopalSaraf/Practicals/PSDL/include/proc/pic18f86k90.inc
#define CCP9IF                           BANKMASK(PIR4), 6, a
#define CCP9IP                           BANKMASK(IPR4), 6, a
#define CCP9M0                           BANKMASK(CCP9CON), 0, b
#define CCP9M1                           BANKMASK(CCP9CON), 1, b
#define CCP9M2                           BANKMASK(CCP9CON), 2, b
#define CCP9M3                           BANKMASK(CCP9CON), 3, b
#define CCP9MD                           BANKMASK(PMD3), 6, b
#define CCP9OD                           BANKMASK(ODCON2), 6, b
#define CCP9X                            BANKMASK(CCP9CON), 5, b
#define CCP9Y                            BANKMASK(CCP9CON), 4, b
#define CE                               BANKMASK(PORTJ), 5, a
#define CFGS                             BANKMASK(EECON1), 6, a
#define CHIME                            BANKMASK(ALRMCFG), 6, b
#define CHS0                             BANKMASK(ADCON0), 2, a
#define CHS1                             BANKMASK(ADCON0), 3, a
#define CHS2                             BANKMASK(ADCON0), 4, a
#define CHS3                             BANKMASK(ADCON0), 5, a
#define CHS4                             BANKMASK(ADCON0), 6, a
#define CHSN0                            BANKMASK(ADCON1), 0, a
#define CHSN1                            BANKMASK(ADCON1), 1, a
#define CHSN2                            BANKMASK(ADCON1), 2, a
#define CHSN3                            BANKMASK(ADCON1), 3, a
#define CK1                              BANKMASK(PORTC), 6, a
#define CK2                              BANKMASK(PORTG), 1, a
#define CKE1                             BANKMASK(SSP1STAT), 6, a
#define CKE2                             BANKMASK(SSP2STAT), 6, b
#define CKP1                             BANKMASK(SSP1CON1), 4, a
#define CKP2                             BANKMASK(SSP2CON1), 4, b
#define CKTXP                            BANKMASK(BAUDCON1), 4, a
#define CLKI                             BANKMASK(PORTA), 7, a
#define CLKO                             BANKMASK(PORTA), 6, a
#define CM                               BANKMASK(RCON), 5, a
#define CMP1IE                           BANKMASK(PIE6), 0, a
#define CMP1IF                           BANKMASK(PIR6), 0, a
#define CMP1IP                           BANKMASK(IPR6), 0, a
#define CMP1MD                           BANKMASK(PMD2), 0, b
#define CMP1OUT                          BANKMASK(CMSTAT), 5, a
#define CMP2IE                           BANKMASK(PIE6), 1, a
#define CMP2IF                           BANKMASK(PIR6), 1, a
#define CMP2IP                           BANKMASK(IPR6), 1, a
#define CMP2MD                           BANKMASK(PMD2), 1, b
#define CMP2OUT                          BANKMASK(CMSTAT), 6, a
#define CMP3IE                           BANKMASK(PIE6), 2, a
#define CMP3IF                           BANKMASK(PIR6), 2, a
#define CMP3IP                           BANKMASK(IPR6), 2, a
#define CMP3MD                           BANKMASK(PMD2), 2, b
#define CMP3OUT                          BANKMASK(CMSTAT), 7, a
#define CMPL02                           BANKMASK(PSTR2CON), 6, b
#define CMPL03                           BANKMASK(PSTR3CON), 6, b
#define CMPL12                           BANKMASK(PSTR2CON), 7, b
#define CMPL13                           BANKMASK(PSTR3CON), 7, b
#define COE1                             BANKMASK(CM1CON), 6, b
#define COE2                             BANKMASK(CM2CON), 6, b
#define COE3                             BANKMASK(CM3CON), 6, b
#define COM0                             BANKMASK(PORTE), 3, a
#define COM1                             BANKMASK(PORTE), 4, a
#define COM2                             BANKMASK(PORTE), 5, a
#define COM3                             BANKMASK(PORTE), 6, a
#define CON1                             BANKMASK(CM1CON), 7, b
#define CON2                             BANKMASK(CM2CON), 7, b
#define CON3                             BANKMASK(CM3CON), 7, b
#define CPOL1                            BANKMASK(CM1CON), 5, b
#define CPOL2                            BANKMASK(CM2CON), 5, b
#define CPOL3                            BANKMASK(CM3CON), 5, b
#define CREF1                            BANKMASK(CM1CON), 2, b
#define CREF2                            BANKMASK(CM2CON), 2, b
#define CREF3                            BANKMASK(CM3CON), 2, b
#define CREN1                            BANKMASK(RCSTA1), 4, a
#define CREN2                            BANKMASK(RCSTA2), 4, b
#define CS                               BANKMASK(PORTE), 2, a
#define CS0                              BANKMASK(LCDCON), 2, b
#define CS1                              BANKMASK(LCDCON), 3, b
#define CSRC1                            BANKMASK(TXSTA1), 7, a
#define CSRC2                            BANKMASK(TXSTA2), 7, b
#define CTDIN                            BANKMASK(PORTF), 1, a
#define CTED1                            BANKMASK(PORTB), 2, a
#define CTED2                            BANKMASK(PORTB), 3, a
#define CTMUDS                           BANKMASK(ODCON3), 0, b
#define CTMUEN                           BANKMASK(CTMUCONH), 7, b
#define CTMUI                            BANKMASK(PORTF), 3, a
#define CTMUIE                           BANKMASK(PIE3), 3, a
#define CTMUIF                           BANKMASK(PIR3), 3, a
#define CTMUIP                           BANKMASK(IPR3), 3, a
#define CTMUMD                           BANKMASK(PMD1), 6, b
#define CTMUSIDL                         BANKMASK(CTMUCONH), 5, b
#define CTPLS                            BANKMASK(PORTD), 0, a
#define CTTRIG                           BANKMASK(CTMUCONH), 0, b
#define CVR0                             BANKMASK(CVRCON), 0, a
#define CVR1                             BANKMASK(CVRCON), 1, a
#define CVR2                             BANKMASK(CVRCON), 2, a
#define CVR3                             BANKMASK(CVRCON), 3, a
#define CVR4                             BANKMASK(CVRCON), 4, a
#define CVREF                            BANKMASK(PORTF), 5, a
#define CVREN                            BANKMASK(CVRCON), 7, a
#define CVROE                            BANKMASK(CVRCON), 6, a
#define CVROEN                           BANKMASK(CVRCON), 6, a
#define CVRR                             BANKMASK(CVRCON), 5, a
#define CVRSS                            BANKMASK(CVRCON), 5, a
#define DA                               BANKMASK(SSP1STAT), 5, a
#define DA1                              BANKMASK(SSP1STAT), 5, a
#define DA2                              BANKMASK(SSP2STAT), 5, b
#define DATA_ADDRESS2                    BANKMASK(SSP2STAT), 5, b
#define DC                               BANKMASK(STATUS), 1, a
#define DC10B0                           BANKMASK(CCP10CON), 4, b
#define DC10B1                           BANKMASK(CCP10CON), 5, b
#define DC1B0                            BANKMASK(CCP1CON), 4, a
#define DC1B1                            BANKMASK(CCP1CON), 5, a
#define DC2B0                            BANKMASK(CCP2CON), 4, b
#define DC2B1                            BANKMASK(CCP2CON), 5, b
#define DC3B0                            BANKMASK(CCP3CON), 4, b
#define DC3B1                            BANKMASK(CCP3CON), 5, b
#define DC4B0                            BANKMASK(CCP4CON), 4, b
#define DC4B1                            BANKMASK(CCP4CON), 5, b
#define DC5B0                            BANKMASK(CCP5CON), 4, b
#define DC5B1                            BANKMASK(CCP5CON), 5, b
#define DC6B0                            BANKMASK(CCP6CON), 4, b
#define DC6B1                            BANKMASK(CCP6CON), 5, b
#define DC7B0                            BANKMASK(CCP7CON), 4, b
#define DC7B1                            BANKMASK(CCP7CON), 5, b
#define DC8B0                            BANKMASK(CCP8CON), 4, b
#define DC8B1                            BANKMASK(CCP8CON), 5, b
#define DC9B0                            BANKMASK(CCP9CON), 4, b
#define DC9B1                            BANKMASK(CCP9CON), 5, b
#define DONE                             BANKMASK(ADCON0), 1, a
#define DT1                              BANKMASK(PORTC), 7, a
#define DT2                              BANKMASK(PORTG), 2, a
#define DTRXP                            BANKMASK(BAUDCON1), 5, a
#define DTRXP1                           BANKMASK(BAUDCON1), 5, a
#define DTRXP2                           BANKMASK(BAUDCON2), 5, b
#define D_A2                             BANKMASK(SSP2STAT), 5, b
#define D_NOT_A2                         BANKMASK(SSP2STAT), 5, b
#define D_nA2                            BANKMASK(SSP2STAT), 5, b
#define EBDIS                            BANKMASK(PR2), 7, a
#define ECCP1AS0                         BANKMASK(ECCP1AS), 4, a
#define ECCP1AS1                         BANKMASK(ECCP1AS), 5, a
#define ECCP1AS2                         BANKMASK(ECCP1AS), 6, a
#define ECCP1ASE                         BANKMASK(ECCP1AS), 7, a
#define ECCP2AS0                         BANKMASK(ECCP2AS), 4, b
#define ECCP2AS1                         BANKMASK(ECCP2AS), 5, b
#define ECCP2AS2                         BANKMASK(ECCP2AS), 6, b
#define ECCP2ASE                         BANKMASK(ECCP2AS), 7, b
#define ECCP3AS0                         BANKMASK(ECCP3AS), 4, b
#define ECCP3AS1                         BANKMASK(ECCP3AS), 5, b
#define ECCP3AS2                         BANKMASK(ECCP3AS), 6, b
#define ECCP3ASE                         BANKMASK(ECCP3AS), 7, b
#define EDG1POL                          BANKMASK(CTMUCONL), 4, b
#define EDG1SEL0                         BANKMASK(CTMUCONL), 2, b
#define EDG1SEL1                         BANKMASK(CTMUCONL), 3, b
#define EDG1STAT                         BANKMASK(CTMUCONL), 0, b
#define EDG2POL                          BANKMASK(CTMUCONL), 7, b
#define EDG2SEL0                         BANKMASK(CTMUCONL), 5, b
#define EDG2SEL1                         BANKMASK(CTMUCONL), 6, b
#define EDG2STAT                         BANKMASK(CTMUCONL), 1, b
#define EDGEN                            BANKMASK(CTMUCONH), 3, b
#define EDGSEQEN                         BANKMASK(CTMUCONH), 2, b
#define EEFS                             BANKMASK(EECON1), 6, a
#define EEIE                             BANKMASK(PIE6), 4, a
#define EEIF                             BANKMASK(PIR6), 4, a
#define EEIP                             BANKMASK(IPR6), 4, a
#define EEPGD                            BANKMASK(EECON1), 7, a
#define EVPOL01                          BANKMASK(CM1CON), 3, b
#define EVPOL02                          BANKMASK(CM2CON), 3, b
#define EVPOL03                          BANKMASK(CM3CON), 3, b
#define EVPOL05                          BANKMASK(IPR5), 3, a
#define EVPOL11                          BANKMASK(CM1CON), 4, b
#define EVPOL12                          BANKMASK(CM2CON), 4, b
#define EVPOL13                          BANKMASK(CM3CON), 4, b
#define EVPOL15                          BANKMASK(IPR5), 4, a
#define FERR1                            BANKMASK(RCSTA1), 2, a
#define FERR2                            BANKMASK(RCSTA2), 2, b
#define FLT0                             BANKMASK(PORTB), 0, a
#define FREE                             BANKMASK(EECON1), 4, a
#define GCEN1                            BANKMASK(SSP1CON2), 7, a
#define GCEN2                            BANKMASK(SSP2CON2), 7, b
#define GIE                              BANKMASK(INTCON), 7, a
#define GIEH                             BANKMASK(INTCON), 7, a
#define GIEL                             BANKMASK(INTCON), 6, a
#define GIE_GIEH                         BANKMASK(INTCON), 7, a
#define GO                               BANKMASK(ADCON0), 1, a
#define GODONE                           BANKMASK(ADCON0), 1, a
#define GO_DONE                          BANKMASK(ADCON0), 1, a
#define GO_NOT_DONE                      BANKMASK(ADCON0), 1, a
#define GO_nDONE                         BANKMASK(ADCON0), 1, a
#define HALFSEC                          BANKMASK(RTCCFG), 3, b
#define HFIOFS                           BANKMASK(OSCCON), 2, a
#define HLVDEN                           BANKMASK(HLVDCON), 4, a
#define HLVDIE                           BANKMASK(PIE2), 2, a
#define HLVDIF                           BANKMASK(PIR2), 2, a
#define HLVDIP                           BANKMASK(IPR2), 2, a
#define HLVDL0                           BANKMASK(HLVDCON), 0, a
#define HLVDL1                           BANKMASK(HLVDCON), 1, a
#define HLVDL2                           BANKMASK(HLVDCON), 2, a
#define HLVDL3                           BANKMASK(HLVDCON), 3, a
#define I2C_DAT2                         BANKMASK(SSP2STAT), 5, b
#define I2C_READ2                        BANKMASK(SSP2STAT), 2, b
#define I2C_START2                       BANKMASK(SSP2STAT), 3, b
#define I2C_STOP2                        BANKMASK(SSP2STAT), 4, b
#define IDISSEN                          BANKMASK(CTMUCONH), 1, b
#define IDLEN                            BANKMASK(OSCCON), 7, a
#define INT0                             BANKMASK(PORTB), 0, a
#define INT0E                            BANKMASK(INTCON), 4, a
#define INT0F                            BANKMASK(INTCON), 1, a
#define INT0IE                           BANKMASK(INTCON), 4, a
#define INT0IF                           BANKMASK(INTCON), 1, a
#define INT1                             BANKMASK(PORTB), 1, a
#define INT1E                            BANKMASK(INTCON3), 3, a
#define INT1F                            BANKMASK(INTCON3), 0, a
#define INT1IE                           BANKMASK(INTCON3), 3, a
#define INT1IF                           BANKMASK(INTCON3), 0, a
#define INT1IP                           BANKMASK(INTCON3), 6, a
#define INT1P                            BANKMASK(INTCON3), 6, a
#define INT2                             BANKMASK(PORTB), 2, a
#define INT2E                            BANKMASK(INTCON3), 4, a
#define INT2F                            BANKMASK(INTCON3), 1, a
#define INT2IE                           BANKMASK(INTCON3), 4, a
#define INT2IF                           BANKMASK(INTCON3), 1, a
#define INT2IP                           BANKMASK(INTCON3), 7, a
#define INT2P                            BANKMASK(INTCON3), 7, a
#define INT3                             BANKMASK(PORTB), 3, a
#define INT3E                            BANKMASK(INTCON3), 5, a
#define INT3F                            BANKMASK(INTCON3), 2, a
#define INT3IE                           BANKMASK(INTCON3), 5, a
#define INT3IF                           BANKMASK(INTCON3), 2, a
#define INT3IP                           BANKMASK(INTCON2), 1, a
#define INT3P                            BANKMASK(INTCON2), 1, a
#define INTEDG0                          BANKMASK(INTCON2), 6, a
#define INTEDG1                          BANKMASK(INTCON2), 5, a
#define INTEDG2                          BANKMASK(INTCON2), 4, a
#define INTEDG3                          BANKMASK(INTCON2), 3, a
#define INTSRC                           BANKMASK(OSCTUNE), 7, a
#define IPEN                             BANKMASK(RCON), 7, a
#define IRCF0                            BANKMASK(OSCCON), 4, a
#define IRCF1                            BANKMASK(OSCCON), 5, a
#define IRCF2                            BANKMASK(OSCCON), 6, a
#define IRNG0                            BANKMASK(CTMUICON), 0, b
#define IRNG1                            BANKMASK(CTMUICON), 1, b
#define IRVST                            BANKMASK(HLVDCON), 5, a
#define ITRIM0                           BANKMASK(CTMUICON), 2, b
#define ITRIM1                           BANKMASK(CTMUICON), 3, b
#define ITRIM2                           BANKMASK(CTMUICON), 4, b
#define ITRIM3                           BANKMASK(CTMUICON), 5, b
#define ITRIM4                           BANKMASK(CTMUICON), 6, b
#define ITRIM5                           BANKMASK(CTMUICON), 7, b
#define KBI0                             BANKMASK(PORTB), 4, a
#define KBI1                             BANKMASK(PORTB), 5, a
#define KBI2                             BANKMASK(PORTB), 6, a
#define KBI3                             BANKMASK(PORTB), 7, a
#define LA0                              BANKMASK(LATA), 0, a
#define LA1                              BANKMASK(LATA), 1, a
#define LA2                              BANKMASK(LATA), 2, a
#define LA3                              BANKMASK(LATA), 3, a
#define LA4                              BANKMASK(LATA), 4, a
#define LA5                              BANKMASK(LATA), 5, a
#define LA6                              BANKMASK(LATA), 6, a
#define LA7                              BANKMASK(LATA), 7, a
#define LATA0                            BANKMASK(LATA), 0, a
#define LATA1                            BANKMASK(LATA), 1, a
#define LATA2                            BANKMASK(LATA), 2, a
#define LATA3                            BANKMASK(LATA), 3, a
#define LATA4                            BANKMASK(LATA), 4, a
#define LATA5                            BANKMASK(LATA), 5, a
#define LATA6                            BANKMASK(LATA), 6, a
#define LATA7                            BANKMASK(LATA), 7, a
#define LATB0                            BANKMASK(LATB), 0, a
#define LATB1                            BANKMASK(LATB), 1, a
#define LATB2                            BANKMASK(LATB), 2, a
#define LATB3                            BANKMASK(LATB), 3, a
#define LATB4                            BANKMASK(LATB), 4, a
#define LATB5                            BANKMASK(LATB), 5, a
#define LATB6                            BANKMASK(LATB), 6, a
#define LATB7                            BANKMASK(LATB), 7, a
#define LATC0                            BANKMASK(LATC), 0, a
#define LATC1                            BANKMASK(LATC), 1, a
#define LATC2                            BANKMASK(LATC), 2, a
#define LATC3                            BANKMASK(LATC), 3, a
#define LATC4                            BANKMASK(LATC), 4, a
#define LATC5                            BANKMASK(LATC), 5, a
#define LATC6                            BANKMASK(LATC), 6, a
#define LATC7                            BANKMASK(LATC), 7, a
#define LATD0                            BANKMASK(LATD), 0, a
#define LATD1                            BANKMASK(LATD), 1, a
#define LATD2                            BANKMASK(LATD), 2, a
#define LATD3                            BANKMASK(LATD), 3, a
#define LATD4                            BANKMASK(LATD), 4, a
#define LATD5                            BANKMASK(LATD), 5, a
#define LATD6                            BANKMASK(LATD), 6, a
#define LATD7                            BANKMASK(LATD), 7, a
#define LATE0                            BANKMASK(LATE), 0, a
#define LATE1                            BANKMASK(LATE), 1, a
#define LATE2                            BANKMASK(LATE), 2, a
#define LATE3                            BANKMASK(LATE), 3, a
#define LATE4                            BANKMASK(LATE), 4, a
#define LATE5                            BANKMASK(LATE), 5, a
#define LATE6                            BANKMASK(LATE), 6, a
#define LATE7                            BANKMASK(LATE), 7, a
#define LATF1                            BANKMASK(LATF), 1, a
#define LATF2                            BANKMASK(LATF), 2, a
#define LATF3                            BANKMASK(LATF), 3, a
#define LATF4                            BANKMASK(LATF), 4, a
#define LATF5                            BANKMASK(LATF), 5, a
#define LATF6                            BANKMASK(LATF), 6, a
#define LATF7                            BANKMASK(LATF), 7, a
#define LATG0                            BANKMASK(LATG), 0, a
#define LATG1                            BANKMASK(LATG), 1, a
#define LATG2                            BANKMASK(LATG), 2, a
#define LATG3                            BANKMASK(LATG), 3, a
#define LATG4                            BANKMASK(LATG), 4, a
#define LATH0                            BANKMASK(LATH), 0, a
#define LATH1                            BANKMASK(LATH), 1, a
#define LATH2                            BANKMASK(LATH), 2, a
#define LATH3                            BANKMASK(LATH), 3, a
#define LATH4                            BANKMASK(LATH), 4, a
#define LATH5                            BANKMASK(LATH), 5, a
#define LATH6                            BANKMASK(LATH), 6, a
#define LATH7                            BANKMASK(LATH), 7, a
#define LATJ0                            BANKMASK(LATJ), 0, a
#define LATJ1                            BANKMASK(LATJ), 1, a
#define LATJ2                            BANKMASK(LATJ), 2, a
#define LATJ3                            BANKMASK(LATJ), 3, a
#define LATJ4                            BANKMASK(LATJ), 4, a
#define LATJ5                            BANKMASK(LATJ), 5, a
#define LATJ6                            BANKMASK(LATJ), 6, a
#define LATJ7                            BANKMASK(LATJ), 7, a
#define LB                               BANKMASK(PORTJ), 6, a
#define LB0                              BANKMASK(LATB), 0, a
#define LB1                              BANKMASK(LATB), 1, a
#define LB2                              BANKMASK(LATB), 2, a
#define LB3                              BANKMASK(LATB), 3, a
#define LB4                              BANKMASK(LATB), 4, a
#define LB5                              BANKMASK(LATB), 5, a
#define LB6                              BANKMASK(LATB), 6, a
#define LB7                              BANKMASK(LATB), 7, a
#define LC0                              BANKMASK(LATC), 0, a
#define LC1                              BANKMASK(LATC), 1, a
#define LC2                              BANKMASK(LATC), 2, a
#define LC3                              BANKMASK(LATC), 3, a
#define LC4                              BANKMASK(LATC), 4, a
#define LC5                              BANKMASK(LATC), 5, a
#define LC6                              BANKMASK(LATC), 6, a
#define LC7                              BANKMASK(LATC), 7, a
#define LCDA                             BANKMASK(LCDPS), 5, b
#define LCDBIAS1                         BANKMASK(PORTE), 0, a
#define LCDBIAS2                         BANKMASK(PORTE), 1, a
#define LCDBIAS3                         BANKMASK(PORTE), 2, a
#define LCDCST0                          BANKMASK(LCDREF), 3, b
#define LCDCST1                          BANKMASK(LCDREF), 4, b
#define LCDCST2                          BANKMASK(LCDREF), 5, b
#define LCDEN                            BANKMASK(LCDCON), 7, b
#define LCDIE                            BANKMASK(PIE3), 6, a
#define LCDIF                            BANKMASK(PIR3), 6, a
#define LCDIP                            BANKMASK(IPR3), 6, a
#define LCDIRE                           BANKMASK(LCDREF), 7, b
#define LCDIRI                           BANKMASK(LCDRL), 3, b
#define LCDIRS                           BANKMASK(LCDREF), 6, b
#define LD0                              BANKMASK(LATD), 0, a
#define LD1                              BANKMASK(LATD), 1, a
#define LD2                              BANKMASK(LATD), 2, a
#define LD3                              BANKMASK(LATD), 3, a
#define LD4                              BANKMASK(LATD), 4, a
#define LD5                              BANKMASK(LATD), 5, a
#define LD6                              BANKMASK(LATD), 6, a
#define LD7                              BANKMASK(LATD), 7, a
#define LE0                              BANKMASK(LATE), 0, a
#define LE1                              BANKMASK(LATE), 1, a
#define LE2                              BANKMASK(LATE), 2, a
#define LE3                              BANKMASK(LATE), 3, a
#define LE4                              BANKMASK(LATE), 4, a
#define LE5                              BANKMASK(LATE), 5, a
#define LE6                              BANKMASK(LATE), 6, a
#define LE7                              BANKMASK(LATE), 7, a
#define LF1                              BANKMASK(LATF), 1, a
#define LF2                              BANKMASK(LATF), 2, a
#define LF3                              BANKMASK(LATF), 3, a
#define LF4                              BANKMASK(LATF), 4, a
#define LF5                              BANKMASK(LATF), 5, a
#define LF6                              BANKMASK(LATF), 6, a
#define LF7                              BANKMASK(LATF), 7, a
