GopalSaraf/Practicals/PSDL/include/proc/pic18f86k90.inc
#define S06C0                            BANKMASK(LCDDATA0), 6, a
#define S06C1                            BANKMASK(LCDDATA6), 6, a
#define S06C2                            BANKMASK(LCDDATA12), 6, a
#define S06C3                            BANKMASK(LCDDATA18), 6, a
#define S07C0                            BANKMASK(LCDDATA0), 7, a
#define S07C1                            BANKMASK(LCDDATA6), 7, a
#define S07C2                            BANKMASK(LCDDATA12), 7, a
#define S07C3                            BANKMASK(LCDDATA18), 7, a
#define S08C0                            BANKMASK(LCDDATA1), 0, a
#define S08C1                            BANKMASK(LCDDATA7), 0, a
#define S08C2                            BANKMASK(LCDDATA13), 0, a
#define S08C3                            BANKMASK(LCDDATA19), 0, a
#define S09C0                            BANKMASK(LCDDATA1), 1, a
#define S09C1                            BANKMASK(LCDDATA7), 1, a
#define S09C2                            BANKMASK(LCDDATA13), 1, a
#define S09C3                            BANKMASK(LCDDATA19), 1, a
#define S10C0                            BANKMASK(LCDDATA1), 2, a
#define S10C1                            BANKMASK(LCDDATA7), 2, a
#define S10C2                            BANKMASK(LCDDATA13), 2, a
#define S10C3                            BANKMASK(LCDDATA19), 2, a
#define S11C0                            BANKMASK(LCDDATA1), 3, a
#define S11C1                            BANKMASK(LCDDATA7), 3, a
#define S11C2                            BANKMASK(LCDDATA13), 3, a
#define S11C3                            BANKMASK(LCDDATA19), 3, a
#define S12C0                            BANKMASK(LCDDATA1), 4, a
#define S12C1                            BANKMASK(LCDDATA7), 4, a
#define S12C2                            BANKMASK(LCDDATA13), 4, a
#define S12C3                            BANKMASK(LCDDATA19), 4, a
#define S13C0                            BANKMASK(LCDDATA1), 5, a
#define S13C1                            BANKMASK(LCDDATA7), 5, a
#define S13C2                            BANKMASK(LCDDATA13), 5, a
#define S13C3                            BANKMASK(LCDDATA19), 5, a
#define S14C0                            BANKMASK(LCDDATA1), 6, a
#define S14C1                            BANKMASK(LCDDATA7), 6, a
#define S14C2                            BANKMASK(LCDDATA13), 6, a
#define S14C3                            BANKMASK(LCDDATA19), 6, a
#define S15C0                            BANKMASK(LCDDATA1), 7, a
#define S15C1                            BANKMASK(LCDDATA7), 7, a
#define S15C2                            BANKMASK(LCDDATA13), 7, a
#define S15C3                            BANKMASK(LCDDATA19), 7, a
#define S16C0                            BANKMASK(LCDDATA2), 0, a
#define S16C1                            BANKMASK(LCDDATA8), 0, a
#define S16C2                            BANKMASK(LCDDATA14), 0, a
#define S16C3                            BANKMASK(LCDDATA20), 0, a
#define S17C0                            BANKMASK(LCDDATA2), 1, a
#define S17C1                            BANKMASK(LCDDATA8), 1, a
#define S17C2                            BANKMASK(LCDDATA14), 1, a
#define S17C3                            BANKMASK(LCDDATA20), 1, a
#define S18C0                            BANKMASK(LCDDATA2), 2, a
#define S18C1                            BANKMASK(LCDDATA8), 2, a
#define S18C2                            BANKMASK(LCDDATA14), 2, a
#define S18C3                            BANKMASK(LCDDATA20), 2, a
#define S19C0                            BANKMASK(LCDDATA2), 3, a
#define S19C1                            BANKMASK(LCDDATA8), 3, a
#define S19C2                            BANKMASK(LCDDATA14), 3, a
#define S19C3                            BANKMASK(LCDDATA20), 3, a
#define S2                               BANKMASK(SSP2STAT), 3, b
#define S20C0                            BANKMASK(LCDDATA2), 4, a
#define S20C1                            BANKMASK(LCDDATA8), 4, a
#define S20C2                            BANKMASK(LCDDATA14), 4, a
#define S20C3                            BANKMASK(LCDDATA20), 4, a
#define S21C0                            BANKMASK(LCDDATA2), 5, a
#define S21C1                            BANKMASK(LCDDATA8), 5, a
#define S21C2                            BANKMASK(LCDDATA14), 5, a
#define S21C3                            BANKMASK(LCDDATA20), 5, a
#define S22C0                            BANKMASK(LCDDATA2), 6, a
#define S22C1                            BANKMASK(LCDDATA8), 6, a
#define S22C2                            BANKMASK(LCDDATA14), 6, a
#define S22C3                            BANKMASK(LCDDATA20), 6, a
#define S23C0                            BANKMASK(LCDDATA2), 7, a
#define S23C1                            BANKMASK(LCDDATA8), 7, a
#define S23C2                            BANKMASK(LCDDATA14), 7, a
#define S23C3                            BANKMASK(LCDDATA20), 7, a
#define S24C0                            BANKMASK(LCDDATA3), 0, a
#define S24C1                            BANKMASK(LCDDATA9), 0, a
#define S24C2                            BANKMASK(LCDDATA15), 0, a
#define S24C3                            BANKMASK(LCDDATA21), 0, a
#define S25C0                            BANKMASK(LCDDATA3), 1, a
#define S25C1                            BANKMASK(LCDDATA9), 1, a
#define S25C2                            BANKMASK(LCDDATA15), 1, a
#define S25C3                            BANKMASK(LCDDATA21), 1, a
#define S26C0                            BANKMASK(LCDDATA3), 2, a
#define S26C1                            BANKMASK(LCDDATA9), 2, a
#define S26C2                            BANKMASK(LCDDATA15), 2, a
#define S26C3                            BANKMASK(LCDDATA21), 2, a
#define S27C0                            BANKMASK(LCDDATA3), 3, a
#define S27C1                            BANKMASK(LCDDATA9), 3, a
#define S27C2                            BANKMASK(LCDDATA15), 3, a
#define S27C3                            BANKMASK(LCDDATA21), 3, a
#define S28C0                            BANKMASK(LCDDATA3), 4, a
#define S28C1                            BANKMASK(LCDDATA9), 4, a
#define S28C2                            BANKMASK(LCDDATA15), 4, a
#define S28C3                            BANKMASK(LCDDATA21), 4, a
#define S29C0                            BANKMASK(LCDDATA3), 5, a
#define S29C1                            BANKMASK(LCDDATA9), 5, a
#define S29C2                            BANKMASK(LCDDATA15), 5, a
#define S29C3                            BANKMASK(LCDDATA21), 5, a
#define S30C0                            BANKMASK(LCDDATA3), 6, a
#define S30C1                            BANKMASK(LCDDATA9), 6, a
#define S30C2                            BANKMASK(LCDDATA15), 6, a
#define S30C3                            BANKMASK(LCDDATA21), 6, a
#define S31C0                            BANKMASK(LCDDATA3), 7, a
#define S31C1                            BANKMASK(LCDDATA9), 7, a
#define S31C2                            BANKMASK(LCDDATA15), 7, a
#define S31C3                            BANKMASK(LCDDATA21), 7, a
#define S32C0                            BANKMASK(LCDDATA4), 0, a
#define S32C1                            BANKMASK(LCDDATA10), 0, a
#define S32C2                            BANKMASK(LCDDATA16), 0, a
#define S32C3                            BANKMASK(LCDDATA22), 0, a
#define S33C0                            BANKMASK(LCDDATA4), 1, a
#define S33C1                            BANKMASK(LCDDATA10), 1, a
#define S33C2                            BANKMASK(LCDDATA16), 1, a
#define S33C3                            BANKMASK(LCDDATA22), 1, a
#define S34C0                            BANKMASK(LCDDATA4), 2, a
#define S34C1                            BANKMASK(LCDDATA10), 2, a
#define S34C2                            BANKMASK(LCDDATA16), 2, a
#define S34C3                            BANKMASK(LCDDATA22), 2, a
#define S35C0                            BANKMASK(LCDDATA4), 3, a
#define S35C1                            BANKMASK(LCDDATA10), 3, a
#define S35C2                            BANKMASK(LCDDATA16), 3, a
#define S35C3                            BANKMASK(LCDDATA22), 3, a
#define S36C0                            BANKMASK(LCDDATA4), 4, a
#define S36C1                            BANKMASK(LCDDATA10), 4, a
#define S36C2                            BANKMASK(LCDDATA16), 4, a
#define S36C3                            BANKMASK(LCDDATA22), 4, a
#define S37C0                            BANKMASK(LCDDATA4), 5, a
#define S37C1                            BANKMASK(LCDDATA10), 5, a
#define S37C2                            BANKMASK(LCDDATA16), 5, a
#define S37C3                            BANKMASK(LCDDATA22), 5, a
#define S38C0                            BANKMASK(LCDDATA4), 6, a
#define S38C1                            BANKMASK(LCDDATA10), 6, a
#define S38C2                            BANKMASK(LCDDATA16), 6, a
#define S38C3                            BANKMASK(LCDDATA22), 6, a
#define S39C0                            BANKMASK(LCDDATA4), 7, a
#define S39C1                            BANKMASK(LCDDATA10), 7, a
#define S39C2                            BANKMASK(LCDDATA16), 7, a
#define S39C3                            BANKMASK(LCDDATA22), 7, a
#define S40C0                            BANKMASK(LCDDATA5), 0, a
#define S40C1                            BANKMASK(LCDDATA11), 0, a
#define S40C15                           BANKMASK(LCDDATA5), 0, a
#define S40C2                            BANKMASK(LCDDATA17), 0, a
#define S40C3                            BANKMASK(LCDDATA23), 0, a
#define S41C0                            BANKMASK(LCDDATA5), 1, a
#define S41C1                            BANKMASK(LCDDATA11), 1, a
#define S41C2                            BANKMASK(LCDDATA17), 1, a
#define S41C3                            BANKMASK(LCDDATA23), 1, a
#define S42C0                            BANKMASK(LCDDATA5), 2, a
#define S42C1                            BANKMASK(LCDDATA11), 2, a
#define S42C2                            BANKMASK(LCDDATA17), 2, a
#define S42C3                            BANKMASK(LCDDATA23), 2, a
#define S43C0                            BANKMASK(LCDDATA5), 3, a
#define S43C1                            BANKMASK(LCDDATA11), 3, a
#define S43C2                            BANKMASK(LCDDATA17), 3, a
#define S43C3                            BANKMASK(LCDDATA23), 3, a
#define S44C0                            BANKMASK(LCDDATA5), 4, a
#define S44C1                            BANKMASK(LCDDATA11), 4, a
#define S44C2                            BANKMASK(LCDDATA17), 4, a
#define S44C3                            BANKMASK(LCDDATA23), 4, a
#define S45C0                            BANKMASK(LCDDATA5), 5, a
#define S45C1                            BANKMASK(LCDDATA11), 5, a
#define S45C2                            BANKMASK(LCDDATA17), 5, a
#define S45C3                            BANKMASK(LCDDATA23), 5, a
#define S46C0                            BANKMASK(LCDDATA5), 6, a
#define S46C1                            BANKMASK(LCDDATA11), 6, a
#define S46C2                            BANKMASK(LCDDATA17), 6, a
#define S46C3                            BANKMASK(LCDDATA23), 6, a
#define S47C0                            BANKMASK(LCDDATA5), 7, a
#define S47C1                            BANKMASK(LCDDATA11), 7, a
#define S47C2                            BANKMASK(LCDDATA17), 7, a
#define S47C3                            BANKMASK(LCDDATA23), 7, a
#define SBOREN                           BANKMASK(RCON), 6, a
#define SCK1                             BANKMASK(PORTC), 3, a
#define SCK2                             BANKMASK(PORTD), 6, a
#define SCKLI                            BANKMASK(PORTC), 0, a
#define SCKP                             BANKMASK(BAUDCON1), 4, a
#define SCKP1                            BANKMASK(BAUDCON1), 4, a
#define SCKP2                            BANKMASK(BAUDCON2), 4, b
#define SCL1                             BANKMASK(PORTC), 3, a
#define SCL2                             BANKMASK(PORTD), 6, a
#define SCS0                             BANKMASK(OSCCON), 0, a
#define SCS1                             BANKMASK(OSCCON), 1, a
#define SDA1                             BANKMASK(PORTC), 4, a
#define SDA2                             BANKMASK(PORTD), 5, a
#define SDI1                             BANKMASK(PORTC), 4, a
#define SDI2                             BANKMASK(PORTD), 5, a
#define SDO1                             BANKMASK(PORTC), 5, a
#define SDO2                             BANKMASK(PORTD), 4, a
#define SE00                             BANKMASK(LCDSE0), 0, b
#define SE01                             BANKMASK(LCDSE0), 1, b
#define SE02                             BANKMASK(LCDSE0), 2, b
#define SE03                             BANKMASK(LCDSE0), 3, b
#define SE04                             BANKMASK(LCDSE0), 4, b
#define SE05                             BANKMASK(LCDSE0), 5, b
#define SE06                             BANKMASK(LCDSE0), 6, b
#define SE07                             BANKMASK(LCDSE0), 7, b
#define SE08                             BANKMASK(LCDSE1), 0, b
#define SE09                             BANKMASK(LCDSE1), 1, b
#define SE10                             BANKMASK(LCDSE1), 2, b
#define SE11                             BANKMASK(LCDSE1), 3, b
#define SE12                             BANKMASK(LCDSE1), 4, b
#define SE13                             BANKMASK(LCDSE1), 5, b
#define SE14                             BANKMASK(LCDSE1), 6, b
#define SE15                             BANKMASK(LCDSE1), 7, b
#define SE16                             BANKMASK(LCDSE2), 0, b
#define SE17                             BANKMASK(LCDSE2), 1, b
#define SE18                             BANKMASK(LCDSE2), 2, b
#define SE19                             BANKMASK(LCDSE2), 3, b
#define SE20                             BANKMASK(LCDSE2), 4, b
#define SE21                             BANKMASK(LCDSE2), 5, b
#define SE22                             BANKMASK(LCDSE2), 6, b
#define SE23                             BANKMASK(LCDSE2), 7, b
#define SE24                             BANKMASK(LCDSE3), 0, b
#define SE25                             BANKMASK(LCDSE3), 1, b
#define SE26                             BANKMASK(LCDSE3), 2, b
#define SE27                             BANKMASK(LCDSE3), 3, b
#define SE28                             BANKMASK(LCDSE3), 4, b
#define SE29                             BANKMASK(LCDSE3), 5, b
#define SE30                             BANKMASK(LCDSE3), 6, b
#define SE31                             BANKMASK(LCDSE3), 7, b
#define SE32                             BANKMASK(LCDSE4), 0, b
#define SE33                             BANKMASK(LCDSE4), 1, b
#define SE34                             BANKMASK(LCDSE4), 2, b
#define SE35                             BANKMASK(LCDSE4), 3, b
#define SE36                             BANKMASK(LCDSE4), 4, b
#define SE37                             BANKMASK(LCDSE4), 5, b
#define SE38                             BANKMASK(LCDSE4), 6, b
#define SE39                             BANKMASK(LCDSE4), 7, b
#define SE40                             BANKMASK(LCDSE5), 0, b
#define SE41                             BANKMASK(LCDSE5), 1, b
#define SE42                             BANKMASK(LCDSE5), 2, b
#define SE43                             BANKMASK(LCDSE5), 3, b
#define SE44                             BANKMASK(LCDSE5), 4, b
#define SE45                             BANKMASK(LCDSE5), 5, b
#define SE46                             BANKMASK(LCDSE5), 6, b
#define SE47                             BANKMASK(LCDSE5), 7, b
#define SEG0                             BANKMASK(PORTD), 0, a
#define SEG1                             BANKMASK(PORTD), 1, a
#define SEG10                            BANKMASK(PORTB), 3, a
#define SEG11                            BANKMASK(PORTB), 4, a
#define SEG12                            BANKMASK(PORTC), 5, a
#define SEG13                            BANKMASK(PORTC), 2, a
#define SEG14                            BANKMASK(PORTA), 4, a
#define SEG15                            BANKMASK(PORTA), 5, a
#define SEG16                            BANKMASK(PORTC), 4, a
#define SEG17                            BANKMASK(PORTC), 3, a
#define SEG18                            BANKMASK(PORTA), 1, a
#define SEG19                            BANKMASK(PORTF), 1, a
#define SEG2                             BANKMASK(PORTD), 2, a
#define SEG20                            BANKMASK(PORTF), 2, a
#define SEG21                            BANKMASK(PORTF), 3, a
#define SEG22                            BANKMASK(PORTF), 4, a
#define SEG23                            BANKMASK(PORTF), 5, a
#define SEG24                            BANKMASK(PORTF), 6, a
#define SEG25                            BANKMASK(PORTF), 7, a
#define SEG26                            BANKMASK(PORTG), 4, a
#define SEG27                            BANKMASK(PORTC), 6, a
#define SEG28                            BANKMASK(PORTC), 7, a
#define SEG29                            BANKMASK(PORTB), 5, a
#define SEG3                             BANKMASK(PORTD), 3, a
#define SEG30                            BANKMASK(PORTB), 0, a
#define SEG31                            BANKMASK(PORTE), 7, a
#define SEG32                            BANKMASK(PORTC), 1, a
#define SEG33                            BANKMASK(PORTJ), 1, a
#define SEG34                            BANKMASK(PORTJ), 2, a
#define SEG35                            BANKMASK(PORTJ), 3, a
#define SEG36                            BANKMASK(PORTJ), 7, a
#define SEG37                            BANKMASK(PORTJ), 6, a
#define SEG38                            BANKMASK(PORTJ), 5, a
#define SEG39                            BANKMASK(PORTJ), 4, a
#define SEG4                             BANKMASK(PORTD), 4, a
#define SEG40                            BANKMASK(PORTH), 4, a
#define SEG41                            BANKMASK(PORTH), 5, a
#define SEG42                            BANKMASK(PORTH), 6, a
#define SEG43                            BANKMASK(PORTH), 7, a
#define SEG44                            BANKMASK(PORTH), 3, a
#define SEG45                            BANKMASK(PORTH), 2, a
#define SEG46                            BANKMASK(PORTH), 1, a
#define SEG47                            BANKMASK(PORTH), 0, a
#define SEG5                             BANKMASK(PORTD), 5, a
#define SEG6                             BANKMASK(PORTD), 6, a
#define SEG7                             BANKMASK(PORTD), 7, a
#define SEG8                             BANKMASK(PORTB), 1, a
#define SEG9                             BANKMASK(PORTB), 2, a
#define SEN1                             BANKMASK(SSP1CON2), 0, a
#define SEN2                             BANKMASK(SSP2CON2), 0, b
#define SENDB1                           BANKMASK(TXSTA1), 3, a
#define SENDB2                           BANKMASK(TXSTA2), 3, b
#define SLPEN                            BANKMASK(LCDCON), 6, b
#define SMP1                             BANKMASK(SSP1STAT), 7, a
#define SMP2                             BANKMASK(SSP2STAT), 7, b
#define SOSCEN3                          BANKMASK(T3CON), 3, a
#define SOSCEN5                          BANKMASK(T5CON), 3, b
#define SOSCEN7                          BANKMASK(T7CON), 3, b
#define SOSCGO                           BANKMASK(OSCCON2), 3, a
#define SOSCI                            BANKMASK(PORTC), 1, a
#define SOSCO                            BANKMASK(PORTC), 0, a
#define SOSCRUN                          BANKMASK(OSCCON2), 6, a
#define SP0                              BANKMASK(STKPTR), 0, a
#define SP1                              BANKMASK(STKPTR), 1, a
#define SP2                              BANKMASK(STKPTR), 2, a
#define SP3                              BANKMASK(STKPTR), 3, a
#define SP4                              BANKMASK(STKPTR), 4, a
#define SPEN1                            BANKMASK(RCSTA1), 7, a
#define SPEN2                            BANKMASK(RCSTA2), 7, b
#define SPI1MD                           BANKMASK(PMD0), 1, b
#define SPI1OD                           BANKMASK(ODCON1), 7, b
#define SPI2MD                           BANKMASK(PMD0), 2, b
#define SPI2OD                           BANKMASK(ODCON1), 0, b
#define SREN1                            BANKMASK(RCSTA1), 5, a
#define SREN2                            BANKMASK(RCSTA2), 5, b
#define SRENA                            BANKMASK(RCSTA1), 5, a
#define SRETEN                           BANKMASK(WDTCON), 4, a
#define SS1                              BANKMASK(PORTF), 7, a
#define SS2                              BANKMASK(PORTD), 7, a
#define SSP1IE                           BANKMASK(PIE1), 3, a
#define SSP1IF                           BANKMASK(PIR1), 3, a
#define SSP1IP                           BANKMASK(IPR1), 3, a
#define SSP1MD                           BANKMASK(PMD0), 1, b
#define SSP2IE                           BANKMASK(PIE2), 5, a
#define SSP2IF                           BANKMASK(PIR2), 5, a
#define SSP2IP                           BANKMASK(IPR2), 5, a
#define SSP2MD                           BANKMASK(PMD0), 2, b
#define SSPEN1                           BANKMASK(SSP1CON1), 5, a
#define SSPEN2                           BANKMASK(SSP2CON1), 5, b
#define SSPIE                            BANKMASK(PIE1), 3, a
#define SSPIF                            BANKMASK(PIR1), 3, a
#define SSPIP                            BANKMASK(IPR1), 3, a
#define SSPM01                           BANKMASK(SSP1CON1), 0, a
#define SSPM012                          BANKMASK(LCDDATA12), 0, a
#define SSPM02                           BANKMASK(SSP2CON1), 0, b
#define SSPM11                           BANKMASK(SSP1CON1), 1, a
#define SSPM112                          BANKMASK(LCDDATA12), 1, a
#define SSPM12                           BANKMASK(SSP2CON1), 1, b
#define SSPM21                           BANKMASK(SSP1CON1), 2, a
#define SSPM212                          BANKMASK(LCDDATA12), 2, a
#define SSPM22                           BANKMASK(SSP2CON1), 2, b
#define SSPM31                           BANKMASK(SSP1CON1), 3, a
#define SSPM312                          BANKMASK(LCDDATA12), 3, a
#define SSPM32                           BANKMASK(SSP2CON1), 3, b
#define SSPOV1                           BANKMASK(SSP1CON1), 6, a
#define SSPOV2                           BANKMASK(SSP2CON1), 6, b
#define START                            BANKMASK(SSP1STAT), 3, a
#define START1                           BANKMASK(SSP1STAT), 3, a
#define START2                           BANKMASK(SSP2STAT), 3, b
#define STKFUL                           BANKMASK(STKPTR), 7, a
#define STKOVF                           BANKMASK(STKPTR), 7, a
#define STKUNF                           BANKMASK(STKPTR), 6, a
#define STOP                             BANKMASK(SSP1STAT), 4, a
#define STOP1                            BANKMASK(SSP1STAT), 4, a
#define STOP2                            BANKMASK(SSP2STAT), 4, b
#define STRA2                            BANKMASK(PSTR2CON), 0, b
#define STRA3                            BANKMASK(PSTR3CON), 0, b
#define STRB2                            BANKMASK(PSTR2CON), 1, b
#define STRB3                            BANKMASK(PSTR3CON), 1, b
#define STRC2                            BANKMASK(PSTR2CON), 2, b
#define STRC3                            BANKMASK(PSTR3CON), 2, b
#define STRD2                            BANKMASK(PSTR2CON), 3, b
#define STRD3                            BANKMASK(PSTR3CON), 3, b
#define STRSYNC2                         BANKMASK(PSTR2CON), 4, b
#define STRSYNC3                         BANKMASK(PSTR3CON), 4, b
#define SWDTE                            BANKMASK(WDTCON), 0, a
#define SWDTEN                           BANKMASK(WDTCON), 0, a
#define SYNC1                            BANKMASK(TXSTA1), 4, a
#define SYNC2                            BANKMASK(TXSTA2), 4, b
#define T08BIT                           BANKMASK(T0CON), 6, a
#define T0CKI                            BANKMASK(PORTA), 4, a
#define T0CS                             BANKMASK(T0CON), 5, a
#define T0IE                             BANKMASK(INTCON), 5, a
